EDT/УТ/src/Reports/ОтчетКМ3/ОтчетКМ3.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетКМ3</name>
  <attributes>
    <name>РежимФормированияОтчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Report>

EDT/УТ/src/AccumulationRegisters/ЖурналККМ/ЖурналККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЖурналККМ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЧекККМ</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кассир</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЧекККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Секция</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЧекПробитОшибочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыЧеков/ДополнительныеПараметрыЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыЧеков</name>
  <resources>
    <name>НомерДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФПД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЧека</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СуммаЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассовыйСервер</name>
    <type>
      <types>ExchangePlanRef.ОбменСКассовымСервером</types>
    </type>
  </resources>
  <resources>
    <name>МобильноеПриложение</name>
    <type>
      <types>ExchangePlanRef.ИзмененияДляМП</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЧекаКПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерЧекаВКассовомСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФН</name>
    <type>
      <types>CatalogRef.ФискальныеНакопители</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЧекаКВозврату</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <dimensions>
    <name>ЧекККМ</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Reports/ОтчетКМ3/ObjectModule.bsl
Функция Печать(Таб, ДатаНач, ДатаКон, КассаККМ = Неопределено) Экспорт
	Зап = Новый Запрос;
	Если РежимФормированияОтчета = 1 Тогда
		Зап.Текст = "ВЫБРАТЬ
		|	ЖурналККМ.КассаККМ КАК КассаККМ,
		|	ЖурналККМ.Кассир КАК Кассир,
		|	СУММА(ЖурналККМ.Сумма) КАК Сумма,
		|	ЖурналККМ.ЧекККМ КАК ЧекККМ,
		|	ЖурналККМ.ЧекККМ.НомерЧекаККМ КАК НЧ_Старое,
		|	ЖурналККМ.ТипОплаты КАК ТипОплаты,
		|	ЖурналККМ.Секция КАК Секция,
		|	ЖурналККМ.КассаККМ.Владелец КАК Организация,
		|	ДополнительныеПараметрыЧеков.ФД КАК НЧ
		|ИЗ
		|	РегистрНакопления.ЖурналККМ КАК ЖурналККМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЧеков КАК ДополнительныеПараметрыЧеков
		|		ПО ЖурналККМ.ЧекККМ.Ссылка = ДополнительныеПараметрыЧеков.ЧекККМ.Ссылка
		|ГДЕ
		|	ЖурналККМ.Период МЕЖДУ &НачДата И &КонДата
		|	И ЖурналККМ.ЧекПробитОшибочно = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналККМ.КассаККМ,
		|	ЖурналККМ.Кассир,
		|	ЖурналККМ.ЧекККМ,
		|	ЖурналККМ.ЧекККМ.НомерЧекаККМ,
		|	ЖурналККМ.ТипОплаты,
		|	ЖурналККМ.Секция,
		|	ЖурналККМ.КассаККМ.Владелец,
		|	ДополнительныеПараметрыЧеков.ФД
		|
		|УПОРЯДОЧИТЬ ПО
		|	КассаККМ,
		|	Кассир,
		|	ЖурналККМ.ЧекККМ.НомерЧекаККМ
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	КассаККМ,
		|	Кассир,
		|	ТипОплаты";
	ИначеЕсли РежимФормированияОтчета = 2 Тогда
		Зап.Текст = "ВЫБРАТЬ
		            |	ЖурналККМ.КассаККМ КАК КассаККМ,
		            |	ЖурналККМ.Кассир КАК Кассир,
		            |	СУММА(ЖурналККМ.Сумма) КАК Сумма,
		            |	ЖурналККМ.ЧекККМ КАК ЧекККМ,
		            |	ЖурналККМ.ЧекККМ.НомерЧекаККМ КАК НЧ,
		            |	ЖурналККМ.ТипОплаты КАК ТипОплаты,
		            |	ЖурналККМ.Секция КАК Секция,
		            |	ЖурналККМ.КассаККМ.Владелец КАК Организация
		            |ИЗ
		            |	РегистрНакопления.ЖурналККМ КАК ЖурналККМ
		            |ГДЕ
		            |	ЖурналККМ.Период МЕЖДУ &НачДата И &КонДата
		            |	И ЖурналККМ.ЧекПробитОшибочно = ИСТИНА
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ЖурналККМ.КассаККМ,
		            |	ЖурналККМ.Кассир,
		            |	ЖурналККМ.ЧекККМ,
		            |	ЖурналККМ.ЧекККМ.НомерЧекаККМ,
		            |	ЖурналККМ.ТипОплаты,
		            |	ЖурналККМ.Секция,
		            |	ЖурналККМ.КассаККМ.Владелец
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	КассаККМ,
		            |	Кассир,
		            |	ЖурналККМ.ЧекККМ.НомерЧекаККМ
		            |ИТОГИ
		            |	СУММА(Сумма)
		            |ПО
		            |	КассаККМ,
		            |	Кассир,
		            |	ТипОплаты";
	КонецеСли;
				
	зап.УстановитьПараметр("НачДата", НачалоДня(ДатаНач));			
	зап.УстановитьПараметр("КонДата", КонецДня(ДатаКон));			
	//Таб = Новый ТабличныйДокумент;
	Мак = ПолучитьМакет("Макет");
	
	Ш = мак.ПолучитьОбласть("Шапка");
	ОблСтр = мак.ПолучитьОбласть("Строка");
	П = мак.ПолучитьОбласть("Подвал");
	
	
	
	ВыбККМ = Зап.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыбККМ.Следующий() Цикл
		ВыбКассир = ВыбККМ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыбКассир.Следующий() Цикл
			ВыбВО = ВыбКассир.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыбВО.Следующий() Цикл
				ИтСум = ВыбВО.Сумма;
				ККМ = ВыбККМ.КассаККМ;
				Если Найти(ККМ.Владелец.Наименование, "АО") > 0 Тогда
					Кассир = "";
				Иначе	
					Кассир = ВыбКассир.Кассир;
				КонецеСли;	
				ВО = ВыбВО.ТипОплаты;
				
				Ш.Параметры.Кассир = Кассир;
				Ш.Параметры.ТипОплаты = ВО;
				Ш.Параметры.ДатаСоставления = ДатаКон;
				ДФ = Формат(ДатаКон, "ДЛФ=DD");
				Ш.Параметры.ДД = СокрЛП(Лев(ДФ, 2));
				если День(ДатаКон) >= 10 Тогда
					Ш.Параметры.МД = Сред(ДФ, 4, СтрДлина(ДФ) - 10);
				Иначе
					Ш.Параметры.МД = Сред(ДФ, 3, СтрДлина(ДФ) - 9);
				КонецеСли;	
				Ш.Параметры.ГД = Лев(Прав(ДФ, 7), 4);
				
				Ш.Параметры.Модель = ККМ.Модель;
				Ш.Параметры.ПрикладнаяПрограмма = ККМ.ПрикладнаяПрограмма;
				Ш.Параметры.НомерПроизводителя = ККМ.НомерПроизводителя;
				
				Если Не ЗначениеЗаполнено(ККМ.НаименованиеОрганизации) Тогда
					Ш.Параметры.Компания = "ООО «Логистическая компания «Стриж» 127273 г. Москва";
				Иначе
					Ш.Параметры.Компания = ККМ.НаименованиеОрганизации;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ККМ.АдресОрганизации) Тогда
					Ш.Параметры.Адрес = "ул. Огородный проезд д. 20";
				Иначе
					Ш.Параметры.Адрес = ККМ.АдресОрганизации;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ККМ.ИННОрганизации) Тогда
					Ш.Параметры.ИНН = "7715876568";
				Иначе
					Ш.Параметры.ИНН = ККМ.ИННОрганизации;
				КонецЕсли;
				
				Рук = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(ВыбККМ.Организация, КонецДня(ДатаКон),);
				Ш.Параметры.Руководитель = Рук.Руководитель;
				Ш.Параметры.Должность = Рук.РуководительДолжность;
				
				Таб.Вывести(Ш);
				
				ВыбДет = ВыбВО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				НПП = 1;
				Пока ВыбДет.Следующий() Цикл
					ОблСтр.Параметры.НПП = НПП;
					ОблСтр.Параметры.НаимОтдела = ВыбДет.Секция;
					ОблСтр.Параметры.НомерЧека = ВыбДет.НЧ;
					ОблСтр.Параметры.Сумма = ВыбДет.Сумма;
					ОблСтр.Параметры.Кассир = Кассир;
					
					Таб.Вывести(ОблСтр);
					НПП = НПП + 1;
				КонецЦикла;	
				
				П.Параметры.ИтСумма = ИтСум;
				П.Параметры.СуммаПрописью = ОбщегоНазначения.СформироватьСуммуПрописью3(ИтСум);
				Таб.Вывести(П);
				Таб.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;	
	
	таб.КлючПараметровПечати = "КМ3_";
	Возврат Истина;
КонецФункции
